DataProcessors/бит_ЗагрузкаПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаПоказанийСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиПоказаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУлиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/бит_ВидыОперацииВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииВводПоказанийПоСчетчикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводПоказанийПоСчетчикам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацииВводПоказанийПоСчетчикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьТаблицуСчетчиковВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПоСчетчикам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПоСчетчику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многотарифный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрядность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаОтключена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКвартиры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/бит_ЗагрузкаПоказанийСчетчиков/Forms/Форма/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мКэшНомерСтраницы; // Кэширует номер страници.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НомерСтраницы		= 1;
	Объект.ПерваяСтрокаДанных	= 2;
	Объект.НомерКолонкиЛС		= 1;
	Объект.НомерКолонкиУслуги	= 2;
	Объект.НомерКолонкиСчетчика	= 3;
	Объект.НомерКолонкиПоказаний= 4;
	Объект.Организация			= БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Объект.Дата					= ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Область.ЦветТекста = Новый Цвет(51, 51, 51);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Табличный документ (*.xlsx;*.xls)|*.xlsx;*.xls";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".xls"
			ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
			ФайлЧтения = ДиалогВыбораФайла.ПолноеИмяФайла;
			ПрочитатьТабличныйДокументИзExcel();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФайл(Команда)
		
	Если Объект.НомерСтраницы = 0 Тогда
		Объект.НомерСтраницы = 1;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФайлЧтения) Тогда
		ТекстСообщения = НСтр("ru = 'Файл загрузки не выбран!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ФайлЧтения");
		Возврат;	
	КонецЕсли;
	
	ФайлНаДиске = Новый Файл(ФайлЧтения);
	Если нРег(ФайлНаДиске.Расширение) = ".xls"
		ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
		ПрочитатьТабличныйДокументИзExcel();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если Объект.НомерКолонкиЛС = Объект.НомерКолонкиУслуги
		ИЛИ Объект.НомерКолонкиЛС = Объект.НомерКолонкиСчетчика
		ИЛИ Объект.НомерКолонкиЛС = Объект.НомерКолонкиПоказаний
		ИЛИ Объект.НомерКолонкиУслуги = Объект.НомерКолонкиСчетчика
		ИЛИ Объект.НомерКолонкиУслуги = Объект.НомерКолонкиПоказаний
		ИЛИ Объект.НомерКолонкиСчетчика = Объект.НомерКолонкиПоказаний Тогда
		
		ТекстСообщения = НСтр("ru = 'Номерка колонок не должны совпадать.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Группа2");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФайлЧтения) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран файл для загрузки показаний счетчиков.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ФайлЧтения");
		Отказ = Истина;
	КонецЕсли; 
	
	МаксимальнаяКолонка =  Макс(Объект.НомерКолонкиЛС, Объект.НомерКолонкиУслуги, Объект.НомерКолонкиСчетчика, Объект.НомерКолонкиПоказаний);
	МинимальнаяКолонка	=  Мин(Объект.НомерКолонкиЛС, Объект.НомерКолонкиУслуги, Объект.НомерКолонкиСчетчика, Объект.НомерКолонкиПоказаний);
	
	Если ТабличныйДокумент.ШиринаТаблицы < МаксимальнаяКолонка Тогда
		ТекстСообщения = НСтр("ru = 'Количество колонок загружаемого файла меньше указанных в настройках колонок реквизитов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект)
						, "Будет выполнена попытка загрузки показаний счетчиков. Продолжить?"
						, РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ОшибкиЗаписи = "";
		ЗагрузитьНаСервере(ОшибкиЗаписи);
		Если НЕ ПустаяСтрока(ОшибкиЗаписи) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1'"), ОшибкиЗаписи);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрочитатьТабличныйДокументИзExcel()
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ФайлЧтения);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл загрузки не выбран!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ФайлЧтения");
		Объект.НомерСтраницы = мКэшНомерСтраницы;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.DisplayAlerts = False;
		Excel.WorkBooks.Open(ФайлЧтения);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка обращения к приложению Excel, по причине: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;

	Состояние("Обработка файла Microsoft Excel...");
	
	Попытка
		ExcelЛист = Excel.Sheets(Объект.НомерСтраницы);
	Исключение
		Excel.Quit();
		ТекстСообщения = НСтр("ru = 'Ошибка. Возможно неверно указан номер листа книги Excel.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Объект.НомерСтраницы = мКэшНомерСтраницы;
	КонецПопытки;
	
	ОчиститьТабличныйДокумент(ТабличныйДокумент);
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	
	Для Column = 1 По ColumnCount Цикл
		ТабличныйДокумент.Область("C" + Формат(Column, "ЧГ=")).ШиринаКолонки = ExcelЛист.Columns(Column).ColumnWidth;
	КонецЦикла;
	
	Для Row = 1 По RowCount Цикл
		Для Column = 1 По ColumnCount Цикл
			ТабличныйДокумент.Область("R" + Формат(Row, "ЧГ=") +"C" + Формат(Column, "ЧГ=")).Текст = ExcelЛист.Cells(Row,Column).Text;
		КонецЦикла;
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel.Quit();
	
	мКэшНомерСтраницы = Объект.НомерСтраницы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьТабличныйДокумент(ТабличныйДокумент) 

	ТабличныйДокумент.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ОшибкиЗаписи)
	
	ТаблицаСчетчиков = Новый ТаблицаЗначений;
	ТаблицаСчетчиков.Колонки.Добавить("НаименованиеЛС"			, ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаСчетчиков.Колонки.Добавить("НаименованиеУслуги"		, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСчетчиков.Колонки.Добавить("НаименованиеСчетчика"	, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСчетчиков.Колонки.Добавить("ТекущиеПоказания"		, ОбщегоНазначения.ОписаниеТипаЧисло(16,4));
	
	Отказ = Ложь;
	
	// Обход строк.
	Для НомерСтроки = Объект.ПерваяСтрокаДанных По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		НСтр = ТаблицаСчетчиков.Добавить();
		
		// Обход колонок.
		Для НомерКолонки = МинимальнаяКолонка По МаксимальнаяКолонка Цикл
			
			Попытка
				Если НомерКолонки = Объект.НомерКолонкиЛС Тогда
					НСтр.НаименованиеЛС = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).Текст);
				ИначеЕсли НомерКолонки = Объект.НомерКолонкиУслуги Тогда
					НСтр.НаименованиеУслуги = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).Текст);
				ИначеЕсли НомерКолонки = Объект.НомерКолонкиСчетчика Тогда
					НСтр.НаименованиеСчетчика = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).Текст);
				ИначеЕсли НомерКолонки = Объект.НомерКолонкиПоказаний Тогда
					НСтр.ТекущиеПоказания = Число(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).Текст));
				КонецЕсли;
			Исключение
				
				ТекстСообщения = НСтр("ru = 'Ошибка чтения значения ячеки табличного документа (строка %1, колонка %2).'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, НомерСтроки, НомерКолонки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).ЦветТекста = WebЦвета.Красный;
				
				Отказ = Истина;
			КонецПопытки;
			
		КонецЦикла; // Обход колонок.
		
	КонецЦикла; // Обход строк.
	
	Если Отказ = Истина ИЛИ ТаблицаСчетчиков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаСчетчиков.НаименованиеЛС КАК НаименованиеЛС,
	|	ТаблицаСчетчиков.НаименованиеУслуги КАК НаименованиеУслуги,
	|	ТаблицаСчетчиков.НаименованиеСчетчика КАК НаименованиеСчетчика,
	|	ТаблицаСчетчиков.ТекущиеПоказания КАК ТекущиеПоказания
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетчиков
	|ИЗ
	|	&ТаблицаСчетчиков КАК ТаблицаСчетчиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛС,
	|	бит_УслугиЖКХ.Ссылка КАК УслугиЖКХ,
	|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
	|	бит_Счетчики.Ссылка КАК Счетчик,
	|	ВТ_ТаблицаСчетчиков.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА бит_ЛицевыеСчета.Ссылка ЕСТЬ NULL
	|				ИЛИ бит_УслугиЖКХ.Ссылка ЕСТЬ NULL
	|				ИЛИ бит_Счетчики.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Найден,
	|	ВТ_ТаблицаСчетчиков.НаименованиеЛС КАК НаименованиеЛС,
	|	ВТ_ТаблицаСчетчиков.НаименованиеУслуги КАК НаименованиеУслуги,
	|	ВТ_ТаблицаСчетчиков.НаименованиеСчетчика КАК НаименованиеСчетчика,
	|	бит_ЛицевыеСчета.Здание.Улица КАК Улица,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	ВТ_ТаблицаСчетчиков КАК ВТ_ТаблицаСчетчиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО ВТ_ТаблицаСчетчиков.НаименованиеЛС = бит_ЛицевыеСчета.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ПО ВТ_ТаблицаСчетчиков.НаименованиеУслуги = бит_УслугиЖКХ.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Счетчики КАК бит_Счетчики
	|		ПО ВТ_ТаблицаСчетчиков.НаименованиеСчетчика = бит_Счетчики.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.ЛС КАК ЛицевойСчет,
	|	ВТ_ИтоговаяТаблица.УслугиЖКХ КАК Услуга,
	|	ВТ_ИтоговаяТаблица.Приоритет КАК Приоритет,
	|	ВТ_ИтоговаяТаблица.Счетчик КАК Счетчик,
	|	ВТ_ИтоговаяТаблица.ТекущиеПоказания КАК Показания,
	|	ВТ_ИтоговаяТаблица.Улица КАК Улица,
	|	ВТ_ИтоговаяТаблица.Здание КАК Здание,
	|	ВТ_ИтоговаяТаблица.Квартира КАК Квартира,
	|	ВТ_ИтоговаяТаблица.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|ГДЕ
	|	ВТ_ИтоговаяТаблица.Найден
	|ИТОГИ ПО
	|	УлицаЛицевогоСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблица.Улица КАК Улица
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.НаименованиеЛС КАК НаименованиеЛС,
	|	ВТ_ИтоговаяТаблица.НаименованиеУслуги КАК НаименованиеУслуги,
	|	ВТ_ИтоговаяТаблица.НаименованиеСчетчика КАК НаименованиеСчетчика
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|ГДЕ
	|	НЕ ВТ_ИтоговаяТаблица.Найден";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	ОтборУлица	= Объект.СписокУлиц.Выгрузить(,"Улица").ВыгрузитьКолонку("Улица");
	ОтборЗдания	= Объект.СписокЗданий.Выгрузить(,"Здание").ВыгрузитьКолонку("Здание");
	
	Если ОтборЗдания.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("бит_ЛицевыеСчета.Здание В (&Здание)");
	КонецЕсли;
	
	Если ОтборУлица.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("бит_ЛицевыеСчета.Здание.Улица В (&Улица)");
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("ТаблицаСчетчиков", ТаблицаСчетчиков);
	Запрос.УстановитьПараметр("Здание"			, ОтборЗдания);
	Запрос.УстановитьПараметр("Улица"			, ОтборУлица);
	
	Результаты = Запрос.ВыполнитьПакет();
	НайденныеСчетчики	= Результаты[2].Выгрузить();
	ВыборкаУлиц			= Результаты[3].Выбрать();
	НеНайденныеСчетчики	= Результаты[4].Выбрать();
	
	Если НайденныеСчетчики.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В информационной базе не найдены счетчики из файла с текущими настройками отбора.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НайденныеСчетчики.Индексы.Добавить("Улица, ЛицевойСчет, Счетчик, Услуга");
	
	Ошибка = Ложь;
	НачатьТранзакцию();
	Пока ВыборкаУлиц.Следующий() Цикл
		
		ПревышениеРазрядности = Ложь;
		
		ДокументВводПоказаний					= Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		ДокументВводПоказаний.Дата				= Объект.Дата;
		ДокументВводПоказаний.Организация		= Объект.Организация;
		ДокументВводПоказаний.ВидОперации		= Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний;
		ДокументВводПоказаний.ТипСчетчика		= Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.ПоказанияНаселения= Истина;
		ДокументВводПоказаний.Улица				= ВыборкаУлиц.Улица;
		ДокументВводПоказаний.Ответственный		= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		ДокументВводПоказаний.Комментарий		= "Документ создан из обработки загрузки показаний.";
		ДокументВводПоказаний.ПоказанияПоСчетчикам.Очистить();
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элт Из ДокументВводПоказаний.ПоказанияПоСчетчикам Цикл
			
			// Пропускаем уже обработанные счетчики (Индивидуальные с несколькими услугами).
			Если Элт.ТекущиеПоказания > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Элт.Многотарифный Тогда
				
				Отбор = Новый Структура("Улица, ЛицевойСчет, Счетчик, Услуга", ВыборкаУлиц.Улица, Элт.ЛицевойСчет, Элт.Счетчик, Элт.Услуга); 
				ПоказанияСчетчика = НайденныеСчетчики.Скопировать(Отбор);
				
				Если ПоказанияСчетчика.Количество() = 0 Тогда
					Продолжить;
				Иначе
					СтрокаПоказаний = ПоказанияСчетчика[0];
				КонецЕсли;
				
				
				// Заполняем услугу по счетчику.
				СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("ЛицевойСчет, Счетчик, Услуга", СтрокаПоказаний.ЛицевойСчет, СтрокаПоказаний.Счетчик, СтрокаПоказаний.Услуга));
				
				Если СтрокиПоиска.Количество() = 0 Тогда
					Продолжить;
				Иначе
					СтрокаТаблицы = СтрокиПоиска[0];
				КонецЕсли;
				
				ЗаполнитьСтрокуТЧДокумента(СтрокаТаблицы, СтрокаПоказаний, ПревышениеРазрядности);
				
			Иначе
				
				Отбор = Новый Структура("Улица, ЛицевойСчет, Счетчик, Услуга", ВыборкаУлиц.Улица, Элт.ЛицевойСчет, Элт.Счетчик, Элт.Услуга); 
				ПоказанияСчетчика = НайденныеСчетчики.Скопировать(Отбор);
				ПоказанияСчетчика.Сортировать("Приоритет Возр");
				
				Если ПоказанияСчетчика.Количество() = 0 Тогда
					Продолжить;	
				Иначе
					СтрокаПоказаний = ПоказанияСчетчика[0];
				КонецЕсли;
				
				
				// Заполняем все услуги счетчика по услуге с наивысшим приоритетом (1- наивысший, 999..-низший).
				СтрокиПоиска = ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("ЛицевойСчет, Счетчик",  СтрокаПоказаний.ЛицевойСчет, СтрокаПоказаний.Счетчик));
				Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
					ЗаполнитьСтрокуТЧДокумента(СтрокаТаблицы, СтрокаПоказаний, ПревышениеРазрядности);
				КонецЦикла;
				
			КонецЕсли;
			
			ПоказанияСчетчика = Неопределено;
			
		КонецЦикла; // ДокументВводПоказаний.ПоказанияПоСчетчикам.
		
		// Удаление счетчиков без показаний жильцов.
		ОтборБезПоказаний	= Новый Структура("ТекущиеПоказания",0);
		СтрокиБезПоказаний	= ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(ОтборБезПоказаний);

		Если СтрокиБезПоказаний.Количество() > 0 Тогда
			Для Каждого Элт Из СтрокиБезПоказаний Цикл
				ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Элт);
			КонецЦикла;
		КонецЕсли;
		
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() = 0 Тогда
			 Продолжить;
		КонецЕсли;
		
		Попытка
			Если ПревышениеРазрядности Тогда
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Запись);
			Иначе
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			ТекстСообщения = НСтр("ru = 'Создан документ ввода показаний: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументВводПоказаний.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументВводПоказаний.Ссылка);
		Исключение
			Ошибка = Истина;
			ТекстСообщения = НСтр("ru = 'Ошибка при записи документов ввода показаний счетчиков: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла; // Обход по улицам. 
	
	
	Если НеНайденныеСчетчики.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'При формировании документов ввода показаний не найдены счетчики:'");
		Пока НеНайденныеСчетчики.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'ЛС: %1, Услуга: %2, Счетчик: %3'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, НеНайденныеСчетчики.НаименованиеЛС, НеНайденныеСчетчики.НаименованиеУслуги, НеНайденныеСчетчики.НаименованиеСчетчика);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если НЕ Ошибка Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТЧДокумента(СтрокаТаблицы, СтрокаПоказаний, ПревышениеРазрядности);
	
	СтрокаТаблицы.ТекущиеПоказания = СтрокаПоказаний.Показания;
	
	// Проверка перехода через 0.
	Если СтрокаТаблицы.ТекущиеПоказания < СтрокаТаблицы.ПредыдущиеПоказания Тогда
		Разность = СтрокаТаблицы.Разрядность - СтрокаТаблицы.ПредыдущиеПоказания + 1 + СтрокаТаблицы.ТекущиеПоказания;
	Иначе
		Разность = СтрокаТаблицы.ТекущиеПоказания - СтрокаТаблицы.ПредыдущиеПоказания;
	КонецЕсли;	
	
	СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
	
	Если СтрокаТаблицы.ТекущиеПоказания > СтрокаТаблицы.Разрядность Тогда
		ПревышениеРазрядности = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
